In [3]:
import numpy as np
import pandas as pd

In [4]:
names = ['Ramesh','Suresh','Mahesh']
age = [20,22,24]
pd.DataFrame(zip(names,age))

        0   1
0  Ramesh  20
1  Suresh  22
2  Mahesh  24

**pd.Dataframe(data, index, colummns)**

- data: None
- index: index or array like
- columns: index or array like

In [5]:
names = ['Ramesh','Suresh','Mahesh']
age = [20,22,24]
pd.DataFrame((names,age))

        0       1       2
0  Ramesh  Suresh  Mahesh
1      20      22      24

### step 3: Add the column names

In [6]:
names = ['Ramesh','Suresh','Mahesh']
age = [20,22,24]
pd.DataFrame(zip(names,age), columns = ['Names','Age'])

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   24

### Step 4: Change the index

In [7]:
names = ['Ramesh','Suresh','Mahesh']
age = [20,22,24]
pd.DataFrame(zip(names,age),['A','B','C'], columns = ['Names','Age'])

    Names  Age
A  Ramesh   20
B  Suresh   22
C  Mahesh   24

In [8]:
# Above we created datarame with values directly
# Now we will first define dataframe and then add values
df = pd.DataFrame()

In [9]:
#df['Names']
# if i run this it will give error since its empty
# we use

In [10]:
df = pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','Mahesh']
df['Age'] = [20,22,24]
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   24

In [11]:
# My dataframe name is df
df['Age']

0    20
1    22
2    24
Name: Age, dtype: int64

In [12]:
df['Age'] = [30,20,34]
df['age'] = [100,200,300]
df['city'] = ['Hyd','Blr','Chennai']

In [13]:
df

    Names  Age  age     city
0  Ramesh   30  100      Hyd
1  Suresh   20  200      Blr
2  Mahesh   34  300  Chennai

**Notes**

- python is case sensitive, number of rows always should be length of the dataframe
- 'Age' and 'age' are considered different
- updated columns always should be length of df

### step 6 drop the columns

- labels:
- axis: 'Axis' = 0, # used to indicate whether to drop row or column
- index:
- columns:
- inplace: 'bool' = False,

In [14]:
df.drop(2)

    Names  Age  age city
0  Ramesh   30  100  Hyd
1  Suresh   20  200  Blr

In [15]:
df.drop([2])

    Names  Age  age city
0  Ramesh   30  100  Hyd
1  Suresh   20  200  Blr

In [16]:
df.drop(2,axis = 0)

    Names  Age  age city
0  Ramesh   30  100  Hyd
1  Suresh   20  200  Blr

In [17]:
df.drop('age',axis = 1)

    Names  Age     city
0  Ramesh   30      Hyd
1  Suresh   20      Blr
2  Mahesh   34  Chennai

In [18]:
df.columns[2]

'age'

In [19]:
df.drop('age',axis = 1)

    Names  Age     city
0  Ramesh   30      Hyd
1  Suresh   20      Blr
2  Mahesh   34  Chennai

In [20]:
df

    Names  Age  age     city
0  Ramesh   30  100      Hyd
1  Suresh   20  200      Blr
2  Mahesh   34  300  Chennai

In [21]:
df.drop('age',axis = 1, inplace = True)

In [22]:
df

    Names  Age     city
0  Ramesh   30      Hyd
1  Suresh   20      Blr
2  Mahesh   34  Chennai

In [23]:
"""
df.shape
df.size
df.coumns
df.isnull()
len(df)
df.drop_duplicates()
df.info
df.dtypes
"""

'\ndf.shape\ndf.size\ndf.coumns\ndf.isnull()\nlen(df)\ndf.drop_duplicates()\ndf.info\ndf.dtypes\n'

In [25]:
df

    Names  Age     city
0  Ramesh   30      Hyd
1  Suresh   20      Blr
2  Mahesh   34  Chennai

In [26]:
df = pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','Satish']
df['Age'] = [20,22,24]
df['City'] = ['Hyd', 'Blr','Pune']
df

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

In [30]:
df.drop('City',axis = 1)

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

In [31]:
df.drop(columns = 'City')

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

In [32]:
df.drop(columns = ['City','Age'])

    Names
0  Ramesh
1  Suresh
2  Satish

In [33]:
df.drop(['City','Age'], axis = 1)

    Names
0  Ramesh
1  Suresh
2  Satish

### df.rename
-
 mapper: 'Renamer | None' = None,-
  *-   index: 'Renamer | None' = Non-,    columns: 'Renamer | None' = No-e
    axis: 'Axis | None' = N-n
    copy: 'bool | None' = -o,
    inplace: 'bool' = -ae,
    level: 'Level | None' - ne,
    errors: 'IgnoreRaise' = '- ignore',
) -> 'DataFrame | None'

In [34]:
dict1 = {'City':'city'}
#df.rename(dict1)
df.rename(dict1, axis = 1)

    Names  Age  city
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

In [35]:
dict2 = {0:'A',1:'B',2:'C'}
df.rename(dict2)

    Names  Age  City
A  Ramesh   20   Hyd
B  Suresh   22   Blr
C  Satish   24  Pune

In [37]:
# we can also use df.columns
df.columns = ['A',"B","C"]
df

        A   B     C
0  Ramesh  20   Hyd
1  Suresh  22   Blr
2  Satish  24  Pune

In [38]:
df.index = ['A',"B",'C']
df

        A   B     C
A  Ramesh  20   Hyd
B  Suresh  22   Blr
C  Satish  24  Pune

In [39]:
df.columns = ['Names', 'Age', 'City']
df.index = [0,1,2]
df

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

## Step-8: append the rows

### loc

- we need to use **loc**

- df.loc[< row numbers >, < column names >]

In [40]:
df.loc[2,'City']

'Pune'

### To get values

In [41]:
df.loc[[1,2],'City']

1     Blr
2    Pune
Name: City, dtype: object

In [42]:
df.loc[[1,2],['Names','City']]

    Names  City
1  Suresh   Blr
2  Satish  Pune

### using range

In [44]:
df.loc[0:2,['Names','City']]

    Names  City
0  Ramesh   Hyd
1  Suresh   Blr
2  Satish  Pune

In [46]:
df.loc[0:2:2,['Names','City']]

    Names  City
0  Ramesh   Hyd
2  Satish  Pune

In [53]:
df.loc[2]

Names    Satish
Age          24
City       Pune
Name: 2, dtype: object

In [63]:
type(df.loc[2])

pandas.core.series.Series

In [51]:
df.loc[[2]]

    Names  Age  City
2  Satish   24  Pune

In [64]:
type(df.loc[[2]])

pandas.core.frame.DataFrame

In [48]:
df.loc[[1,2]]

    Names  Age  City
1  Suresh   22   Blr
2  Satish   24  Pune

In [65]:
type(df.loc[[1,2]])

pandas.core.frame.DataFrame

In [49]:
df.loc[0:3]

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

In [66]:
type(df.loc[0:3])

pandas.core.frame.DataFrame

In [55]:
df.loc[:]

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

In [67]:
type(df.loc[:])

pandas.core.frame.DataFrame

In [56]:
df.loc[2,'City']

'Pune'

In [68]:
type(df.loc[2,'City'])

str

In [57]:
df.loc[2,['City']]

City    Pune
Name: 2, dtype: object

In [69]:
type(df.loc[2,['City']])

pandas.core.series.Series

In [58]:
df.loc[[2],['City']]

   City
2  Pune

In [70]:
type(df.loc[[2],['City']])

pandas.core.frame.DataFrame

In [59]:
df.loc[[1,2],['Names','City']]

    Names  City
1  Suresh   Blr
2  Satish  Pune

In [71]:
type(df.loc[[1,2],['Names','City']])

pandas.core.frame.DataFrame

In [61]:
df.loc[:,'City']

0     Hyd
1     Blr
2    Pune
Name: City, dtype: object

In [72]:
type(df.loc[:,'City'])

pandas.core.series.Series

In [62]:
df.loc[:,['City']]

   City
0   Hyd
1   Blr
2  Pune

In [73]:
type(df.loc[:,['City']])

pandas.core.frame.DataFrame

### iloc

In [75]:
df.iloc[2,2]

'Pune'

In [76]:
df.iloc[:,:]

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

In [78]:
df.iloc[1:2,1:2]

   Age
1   22

In [79]:
df.iloc[[1,2],[1,2]]

   Age  City
1   22   Blr
2   24  Pune

In [80]:
df.iloc[:,[1,2]]

   Age  City
0   20   Hyd
1   22   Blr
2   24  Pune

In [91]:
df.iloc[[2],[2]]

   City
2  Pune

In [92]:
df.iloc[[1,2],2]

1     Blr
2    Pune
Name: City, dtype: object

In [86]:
df.iloc[1,[1,2]]

Age      22
City    Blr
Name: 1, dtype: object

In [87]:
df.iloc[1,:]

Names    Suresh
Age          22
City        Blr
Name: 1, dtype: object

In [88]:
df.iloc[:,1]

0    20
1    22
2    24
Name: Age, dtype: int64

In [114]:
df.iloc[:,:]

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

In [93]:
df.iloc[:,[2]]

   City
0   Hyd
1   Blr
2  Pune

### step-9 save the dataframe

- where i want to save

- on what extension i want to save

- on what name i want to save

In [96]:
path = "C:/Users/ameen/Downloads/sample.csv"
path2 = r"sample.csv"
path3 = "C:/Users/ameen/Downloads/sample.xlsx"
path4 = r"sample.xlsx"

In [111]:
df.to_csv(path, index = False)
df.to_csv(path2, index = False)

In [112]:
### step 10: Reading the dataframe
new_df = pd.read_csv("C:/Users/ameen/Downloads/sample.csv")

In [113]:
new_df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [115]:
new_df

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Satish   24  Pune

In [1]:
import pandas as pd
visa_df = pd.read_csv("C:/Users/ameen/Downloads/Visadataset - Visadataset.csv")
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [2]:
bank_df = pd.read_csv("C:/Users/ameen/Downloads/bank.csv",sep = ";")
bank_df

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [3]:
visa_df.shape

(25480, 12)

In [4]:
visa_df.size

305760

In [5]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [6]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [7]:
visa_df.drop_duplicates()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [8]:
visa_df.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

In [9]:
visa_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

In [10]:
list(visa_df.columns).index('case_status')

11

In [11]:
visa_df.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

In [12]:
visa_df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [13]:
visa_df1 = visa_df.copy()

In [14]:
visa_df1.shape, visa_df.shape

((25480, 12), (25480, 12))

In [15]:
type(visa_df.dtypes)

pandas.core.series.Series

- series is a key value pair

- series can only form a dictionary when we typecast dict

- series can also easily be converted into dataframe

In [16]:
df1 = pd.DataFrame(visa_df.dtypes, columns = ['Type'])

In [17]:
df1.reset_index(inplace = True)

In [18]:
df1

                    index     Type
0                 case_id   object
1               continent   object
2   education_of_employee   object
3      has_job_experience   object
4   requires_job_training   object
5         no_of_employees    int64
6             yr_of_estab    int64
7    region_of_employment   object
8         prevailing_wage  float64
9            unit_of_wage   object
10     full_time_position   object
11            case_status   object

In [19]:
df1.rename({'index': 'Columns'}, axis = 1, inplace = True)

In [20]:
df1

                  Columns     Type
0                 case_id   object
1               continent   object
2   education_of_employee   object
3      has_job_experience   object
4   requires_job_training   object
5         no_of_employees    int64
6             yr_of_estab    int64
7    region_of_employment   object
8         prevailing_wage  float64
9            unit_of_wage   object
10     full_time_position   object
11            case_status   object

In [21]:
d = visa_df.dtypes.to_dict()

In [22]:
values = list(d.values())

In [23]:
values

[dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O'),
 dtype('O')]

In [24]:
keys = list(d.keys())

In [25]:
keys

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [26]:
import numpy as np

In [27]:
object_list = []
num_list = []

for key, val in zip(keys, values):
    if val == np.dtype('O'):
        object_list.append(key)
    else:
        num_list.append(key)

print(object_list)
print(num_list)

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

In [28]:
object_list = []
num_list = []

for i,j in visa_df.dtypes.to_dict().items():
    if j == "object":
        object_list.append(i)
    else:
        num_list.append(i)

print(object_list)
print(num_list)

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

In [29]:
object_list = [i for i,j in visa_df.dtypes.to_dict().items() if j == 'object']
num_list = [i for i,j in visa_df.dtypes.to_dict().items() if j != 'object']

print(object_list)
print(num_list)

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

In [39]:
visa_df.dtypes.to_dict().items()

dict_items([('case_id', dtype('O')), ('continent', dtype('O')), ('education_of_employee', dtype('O')), ('has_job_experience', dtype('O')), ('requires_job_training', dtype('O')), ('no_of_employees', dtype('int64')), ('yr_of_estab', dtype('int64')), ('region_of_employment', dtype('O')), ('prevailing_wage', dtype('float64')), ('unit_of_wage', dtype('O')), ('full_time_position', dtype('O')), ('case_status', dtype('O'))])